dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxRif_bf.h
/**
 * \file IfxRif_bf.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Rif_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Rif_Registers
 * 
 */
#ifndef IFXRIF_BF_H
#define IFXRIF_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Rif_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_RIF_CLC_Bits.DISR */
#define IFX_RIF_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_RIF_CLC_Bits.DISR */
#define IFX_RIF_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_RIF_CLC_Bits.DISR */
#define IFX_RIF_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_RIF_CLC_Bits.DISS */
#define IFX_RIF_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_RIF_CLC_Bits.DISS */
#define IFX_RIF_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_CLC_Bits.DISS */
#define IFX_RIF_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_RIF_CLC_Bits.FDIS */
#define IFX_RIF_CLC_FDIS_LEN (1u)

/** \brief Mask for Ifx_RIF_CLC_Bits.FDIS */
#define IFX_RIF_CLC_FDIS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_CLC_Bits.FDIS */
#define IFX_RIF_CLC_FDIS_OFF (2u)

/** \brief Length for Ifx_RIF_CLC_Bits.EDIS */
#define IFX_RIF_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_RIF_CLC_Bits.EDIS */
#define IFX_RIF_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_CLC_Bits.EDIS */
#define IFX_RIF_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_RIF_ID_Bits.MODREV */
#define IFX_RIF_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_RIF_ID_Bits.MODREV */
#define IFX_RIF_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_RIF_ID_Bits.MODREV */
#define IFX_RIF_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_RIF_ID_Bits.MODTYPE */
#define IFX_RIF_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_RIF_ID_Bits.MODTYPE */
#define IFX_RIF_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_RIF_ID_Bits.MODTYPE */
#define IFX_RIF_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_RIF_ID_Bits.MODNUMBER */
#define IFX_RIF_ID_MODNUMBER_LEN (16u)

/** \brief Mask for Ifx_RIF_ID_Bits.MODNUMBER */
#define IFX_RIF_ID_MODNUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_ID_Bits.MODNUMBER */
#define IFX_RIF_ID_MODNUMBER_OFF (16u)

/** \brief Length for Ifx_RIF_ESI_Bits.CP */
#define IFX_RIF_ESI_CP_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.CP */
#define IFX_RIF_ESI_CP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.CP */
#define IFX_RIF_ESI_CP_OFF (0u)

/** \brief Length for Ifx_RIF_ESI_Bits.FP */
#define IFX_RIF_ESI_FP_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.FP */
#define IFX_RIF_ESI_FP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.FP */
#define IFX_RIF_ESI_FP_OFF (1u)

/** \brief Length for Ifx_RIF_ESI_Bits.DP0 */
#define IFX_RIF_ESI_DP0_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.DP0 */
#define IFX_RIF_ESI_DP0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.DP0 */
#define IFX_RIF_ESI_DP0_OFF (2u)

/** \brief Length for Ifx_RIF_ESI_Bits.DP1 */
#define IFX_RIF_ESI_DP1_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.DP1 */
#define IFX_RIF_ESI_DP1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.DP1 */
#define IFX_RIF_ESI_DP1_OFF (3u)

/** \brief Length for Ifx_RIF_ESI_Bits.DP2 */
#define IFX_RIF_ESI_DP2_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.DP2 */
#define IFX_RIF_ESI_DP2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.DP2 */
#define IFX_RIF_ESI_DP2_OFF (4u)

/** \brief Length for Ifx_RIF_ESI_Bits.DP3 */
#define IFX_RIF_ESI_DP3_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.DP3 */
#define IFX_RIF_ESI_DP3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.DP3 */
#define IFX_RIF_ESI_DP3_OFF (5u)

/** \brief Length for Ifx_RIF_ESI_Bits.CALEN */
#define IFX_RIF_ESI_CALEN_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.CALEN */
#define IFX_RIF_ESI_CALEN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.CALEN */
#define IFX_RIF_ESI_CALEN_OFF (16u)

/** \brief Length for Ifx_RIF_ESI_Bits.CALBSY */
#define IFX_RIF_ESI_CALBSY_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.CALBSY */
#define IFX_RIF_ESI_CALBSY_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.CALBSY */
#define IFX_RIF_ESI_CALBSY_OFF (17u)

