dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxRif_bf.h
/** \brief Length for Ifx_RIF_FLAGSCL_Bits.FWC */
#define IFX_RIF_FLAGSCL_FWC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.FWC */
#define IFX_RIF_FLAGSCL_FWC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.FWC */
#define IFX_RIF_FLAGSCL_FWC_OFF (17u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.REC */
#define IFX_RIF_FLAGSCL_REC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.REC */
#define IFX_RIF_FLAGSCL_REC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.REC */
#define IFX_RIF_FLAGSCL_REC_OFF (18u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.SWE0C */
#define IFX_RIF_FLAGSCL_SWE0C_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.SWE0C */
#define IFX_RIF_FLAGSCL_SWE0C_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.SWE0C */
#define IFX_RIF_FLAGSCL_SWE0C_OFF (19u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC0 */
#define IFX_RIF_FLAGSCL_CRCC0_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC0 */
#define IFX_RIF_FLAGSCL_CRCC0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC0 */
#define IFX_RIF_FLAGSCL_CRCC0_OFF (20u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC1 */
#define IFX_RIF_FLAGSCL_CRCC1_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC1 */
#define IFX_RIF_FLAGSCL_CRCC1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC1 */
#define IFX_RIF_FLAGSCL_CRCC1_OFF (21u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC2 */
#define IFX_RIF_FLAGSCL_CRCC2_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC2 */
#define IFX_RIF_FLAGSCL_CRCC2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC2 */
#define IFX_RIF_FLAGSCL_CRCC2_OFF (22u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.CRCC3 */
#define IFX_RIF_FLAGSCL_CRCC3_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.CRCC3 */
#define IFX_RIF_FLAGSCL_CRCC3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.CRCC3 */
#define IFX_RIF_FLAGSCL_CRCC3_OFF (23u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.R1EC */
#define IFX_RIF_FLAGSCL_R1EC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.R1EC */
#define IFX_RIF_FLAGSCL_R1EC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.R1EC */
#define IFX_RIF_FLAGSCL_R1EC_OFF (24u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.SWE1C */
#define IFX_RIF_FLAGSCL_SWE1C_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.SWE1C */
#define IFX_RIF_FLAGSCL_SWE1C_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.SWE1C */
#define IFX_RIF_FLAGSCL_SWE1C_OFF (25u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.R1SC */
#define IFX_RIF_FLAGSCL_R1SC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.R1SC */
#define IFX_RIF_FLAGSCL_R1SC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.R1SC */
#define IFX_RIF_FLAGSCL_R1SC_OFF (26u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.SMCC */
#define IFX_RIF_FLAGSCL_SMCC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.SMCC */
#define IFX_RIF_FLAGSCL_SMCC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.SMCC */
#define IFX_RIF_FLAGSCL_SMCC_OFF (29u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.REGCRCC */
#define IFX_RIF_FLAGSCL_REGCRCC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.REGCRCC */
#define IFX_RIF_FLAGSCL_REGCRCC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.REGCRCC */
#define IFX_RIF_FLAGSCL_REGCRCC_OFF (30u)

/** \brief Length for Ifx_RIF_FLAGSCL_Bits.LOCKIC */
#define IFX_RIF_FLAGSCL_LOCKIC_LEN (1u)

/** \brief Mask for Ifx_RIF_FLAGSCL_Bits.LOCKIC */
#define IFX_RIF_FLAGSCL_LOCKIC_MSK (0x1u)

/** \brief Offset for Ifx_RIF_FLAGSCL_Bits.LOCKIC */
#define IFX_RIF_FLAGSCL_LOCKIC_OFF (31u)

/** \brief Length for Ifx_RIF_FWDG_Bits.THRESHOLD */
#define IFX_RIF_FWDG_THRESHOLD_LEN (10u)

/** \brief Mask for Ifx_RIF_FWDG_Bits.THRESHOLD */
#define IFX_RIF_FWDG_THRESHOLD_MSK (0x3ffu)

/** \brief Offset for Ifx_RIF_FWDG_Bits.THRESHOLD */
#define IFX_RIF_FWDG_THRESHOLD_OFF (0u)

/** \brief Length for Ifx_RIF_DFU_Bits.DF */
#define IFX_RIF_DFU_DF_LEN (1u)

/** \brief Mask for Ifx_RIF_DFU_Bits.DF */
#define IFX_RIF_DFU_DF_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DFU_Bits.DF */
#define IFX_RIF_DFU_DF_OFF (0u)

/** \brief Length for Ifx_RIF_DFU_Bits.DA */
#define IFX_RIF_DFU_DA_LEN (1u)

/** \brief Mask for Ifx_RIF_DFU_Bits.DA */
#define IFX_RIF_DFU_DA_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DFU_Bits.DA */
#define IFX_RIF_DFU_DA_OFF (1u)

/** \brief Length for Ifx_RIF_DFU_Bits.MSB */
#define IFX_RIF_DFU_MSB_LEN (1u)

/** \brief Mask for Ifx_RIF_DFU_Bits.MSB */
#define IFX_RIF_DFU_MSB_MSK (0x1u)

/** \brief Offset for Ifx_RIF_DFU_Bits.MSB */
#define IFX_RIF_DFU_MSB_OFF (2u)

/** \brief Length for Ifx_RIF_SRIFOVRCFG_Bits.SKMR */
#define IFX_RIF_SRIFOVRCFG_SKMR_LEN (2u)

/** \brief Mask for Ifx_RIF_SRIFOVRCFG_Bits.SKMR */
#define IFX_RIF_SRIFOVRCFG_SKMR_MSK (0x3u)

/** \brief Offset for Ifx_RIF_SRIFOVRCFG_Bits.SKMR */
#define IFX_RIF_SRIFOVRCFG_SKMR_OFF (0u)

/** \brief Length for Ifx_RIF_RSM2CAP_Bits.ENDSAMPLE */
#define IFX_RIF_RSM2CAP_ENDSAMPLE_LEN (12u)

/** \brief Mask for Ifx_RIF_RSM2CAP_Bits.ENDSAMPLE */
#define IFX_RIF_RSM2CAP_ENDSAMPLE_MSK (0xfffu)

/** \brief Offset for Ifx_RIF_RSM2CAP_Bits.ENDSAMPLE */
#define IFX_RIF_RSM2CAP_ENDSAMPLE_OFF (16u)

/** \brief Length for Ifx_RIF_SKEWCAL_Bits.VALUE */
#define IFX_RIF_SKEWCAL_VALUE_LEN (8u)

/** \brief Mask for Ifx_RIF_SKEWCAL_Bits.VALUE */
#define IFX_RIF_SKEWCAL_VALUE_MSK (0xffu)

/** \brief Offset for Ifx_RIF_SKEWCAL_Bits.VALUE */
#define IFX_RIF_SKEWCAL_VALUE_OFF (0u)

/** \brief Length for Ifx_RIF_SKEWCAL_Bits.ACCP */
#define IFX_RIF_SKEWCAL_ACCP_LEN (2u)

/** \brief Mask for Ifx_RIF_SKEWCAL_Bits.ACCP */
#define IFX_RIF_SKEWCAL_ACCP_MSK (0x3u)

/** \brief Offset for Ifx_RIF_SKEWCAL_Bits.ACCP */
#define IFX_RIF_SKEWCAL_ACCP_OFF (8u)

/** \brief Length for Ifx_RIF_SKEWCAL_Bits.ACCN */
#define IFX_RIF_SKEWCAL_ACCN_LEN (2u)

/** \brief Mask for Ifx_RIF_SKEWCAL_Bits.ACCN */
#define IFX_RIF_SKEWCAL_ACCN_MSK (0x3u)

/** \brief Offset for Ifx_RIF_SKEWCAL_Bits.ACCN */
#define IFX_RIF_SKEWCAL_ACCN_OFF (10u)

/** \brief Length for Ifx_RIF_SKEWCAL_Bits.CALRESULT */
#define IFX_RIF_SKEWCAL_CALRESULT_LEN (8u)

/** \brief Mask for Ifx_RIF_SKEWCAL_Bits.CALRESULT */
#define IFX_RIF_SKEWCAL_CALRESULT_MSK (0xffu)

