dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxRif_bf.h
/** \brief Offset for Ifx_RIF_SKEWCAL_Bits.CALRESULT */
#define IFX_RIF_SKEWCAL_CALRESULT_OFF (16u)

/** \brief Length for Ifx_RIF_LVDSCON0_Bits.FRAME */
#define IFX_RIF_LVDSCON0_FRAME_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON0_Bits.FRAME */
#define IFX_RIF_LVDSCON0_FRAME_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON0_Bits.FRAME */
#define IFX_RIF_LVDSCON0_FRAME_OFF (0u)

/** \brief Length for Ifx_RIF_LVDSCON0_Bits.CLK */
#define IFX_RIF_LVDSCON0_CLK_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON0_Bits.CLK */
#define IFX_RIF_LVDSCON0_CLK_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON0_Bits.CLK */
#define IFX_RIF_LVDSCON0_CLK_OFF (8u)

/** \brief Length for Ifx_RIF_LVDSCON0_Bits.DATA0 */
#define IFX_RIF_LVDSCON0_DATA0_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON0_Bits.DATA0 */
#define IFX_RIF_LVDSCON0_DATA0_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON0_Bits.DATA0 */
#define IFX_RIF_LVDSCON0_DATA0_OFF (16u)

/** \brief Length for Ifx_RIF_LVDSCON0_Bits.DATA1 */
#define IFX_RIF_LVDSCON0_DATA1_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON0_Bits.DATA1 */
#define IFX_RIF_LVDSCON0_DATA1_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON0_Bits.DATA1 */
#define IFX_RIF_LVDSCON0_DATA1_OFF (24u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.DATA2 */
#define IFX_RIF_LVDSCON1_DATA2_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.DATA2 */
#define IFX_RIF_LVDSCON1_DATA2_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.DATA2 */
#define IFX_RIF_LVDSCON1_DATA2_OFF (0u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.DATA3 */
#define IFX_RIF_LVDSCON1_DATA3_LEN (8u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.DATA3 */
#define IFX_RIF_LVDSCON1_DATA3_MSK (0xffu)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.DATA3 */
#define IFX_RIF_LVDSCON1_DATA3_OFF (8u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.MISC */
#define IFX_RIF_LVDSCON1_MISC_LEN (3u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.MISC */
#define IFX_RIF_LVDSCON1_MISC_MSK (0x7u)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.MISC */
#define IFX_RIF_LVDSCON1_MISC_OFF (16u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.RTERM */
#define IFX_RIF_LVDSCON1_RTERM_LEN (3u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.RTERM */
#define IFX_RIF_LVDSCON1_RTERM_MSK (0x7u)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.RTERM */
#define IFX_RIF_LVDSCON1_RTERM_OFF (19u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.PWRDN */
#define IFX_RIF_LVDSCON1_PWRDN_LEN (1u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.PWRDN */
#define IFX_RIF_LVDSCON1_PWRDN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.PWRDN */
#define IFX_RIF_LVDSCON1_PWRDN_OFF (24u)

/** \brief Length for Ifx_RIF_LVDSCON1_Bits.LVDS5VEN */
#define IFX_RIF_LVDSCON1_LVDS5VEN_LEN (1u)

/** \brief Mask for Ifx_RIF_LVDSCON1_Bits.LVDS5VEN */
#define IFX_RIF_LVDSCON1_LVDS5VEN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_LVDSCON1_Bits.LVDS5VEN */
#define IFX_RIF_LVDSCON1_LVDS5VEN_OFF (25u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.FDLY0 */
#define IFX_RIF_DBGDLY0_FDLY0_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.FDLY0 */
#define IFX_RIF_DBGDLY0_FDLY0_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.FDLY0 */
#define IFX_RIF_DBGDLY0_FDLY0_OFF (0u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.CDLY0 */
#define IFX_RIF_DBGDLY0_CDLY0_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.CDLY0 */
#define IFX_RIF_DBGDLY0_CDLY0_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.CDLY0 */
#define IFX_RIF_DBGDLY0_CDLY0_OFF (4u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.DDLY0 */
#define IFX_RIF_DBGDLY0_DDLY0_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.DDLY0 */
#define IFX_RIF_DBGDLY0_DDLY0_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.DDLY0 */
#define IFX_RIF_DBGDLY0_DDLY0_OFF (8u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.FDLY1 */
#define IFX_RIF_DBGDLY0_FDLY1_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.FDLY1 */
#define IFX_RIF_DBGDLY0_FDLY1_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.FDLY1 */
#define IFX_RIF_DBGDLY0_FDLY1_OFF (12u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.CDLY1 */
#define IFX_RIF_DBGDLY0_CDLY1_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.CDLY1 */
#define IFX_RIF_DBGDLY0_CDLY1_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.CDLY1 */
#define IFX_RIF_DBGDLY0_CDLY1_OFF (16u)

/** \brief Length for Ifx_RIF_DBGDLY0_Bits.DDLY1 */
#define IFX_RIF_DBGDLY0_DDLY1_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY0_Bits.DDLY1 */
#define IFX_RIF_DBGDLY0_DDLY1_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY0_Bits.DDLY1 */
#define IFX_RIF_DBGDLY0_DDLY1_OFF (20u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.FDLY2 */
#define IFX_RIF_DBGDLY1_FDLY2_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.FDLY2 */
#define IFX_RIF_DBGDLY1_FDLY2_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.FDLY2 */
#define IFX_RIF_DBGDLY1_FDLY2_OFF (0u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.CDLY2 */
#define IFX_RIF_DBGDLY1_CDLY2_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.CDLY2 */
#define IFX_RIF_DBGDLY1_CDLY2_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.CDLY2 */
#define IFX_RIF_DBGDLY1_CDLY2_OFF (4u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.DDLY2 */
#define IFX_RIF_DBGDLY1_DDLY2_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.DDLY2 */
#define IFX_RIF_DBGDLY1_DDLY2_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.DDLY2 */
#define IFX_RIF_DBGDLY1_DDLY2_OFF (8u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.FDLY3 */
#define IFX_RIF_DBGDLY1_FDLY3_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.FDLY3 */
#define IFX_RIF_DBGDLY1_FDLY3_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.FDLY3 */
#define IFX_RIF_DBGDLY1_FDLY3_OFF (12u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.CDLY3 */
#define IFX_RIF_DBGDLY1_CDLY3_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.CDLY3 */
#define IFX_RIF_DBGDLY1_CDLY3_MSK (0x7u)

/** \brief Offset for Ifx_RIF_DBGDLY1_Bits.CDLY3 */
#define IFX_RIF_DBGDLY1_CDLY3_OFF (16u)

/** \brief Length for Ifx_RIF_DBGDLY1_Bits.DDLY3 */
#define IFX_RIF_DBGDLY1_DDLY3_LEN (3u)

/** \brief Mask for Ifx_RIF_DBGDLY1_Bits.DDLY3 */
#define IFX_RIF_DBGDLY1_DDLY3_MSK (0x7u)

